Table of Contents
 Class BIMPluginHosting
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public class BIMPluginHosting : IBIMPluginHosting, IDisposable
Inheritance
object
BIMPluginHosting
Implements
IBIMPluginHosting
IDisposable
Inherited Members
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 BIMPluginHosting(IBIMPluginFactory, IPluginLogger, string, string)
public BIMPluginHosting(IBIMPluginFactory factory, IPluginLogger logger = null, string eventName = "IdeaStatiCaBIMPluginEvent", string pluginUrlFormat = "net.pipe://localhost/IdeaBIMPlugin{0}")
Parameters
factory IBIMPluginFactory
logger IPluginLogger
eventName string
pluginUrlFormat string
Properties
 HostingTask
public Task HostingTask { get; set; }
Property Value
Task
 Service
public IApplicationBIM Service { get; }
Property Value
IApplicationBIM
Methods
 Dispose()
Performs application-defined tasks associated with freeing, releasing, or resetting unmanaged resources.
public void Dispose()
 Dispose(bool)
protected virtual void Dispose(bool disposing)
Parameters
disposing bool
 NotifyAppStatusChanged(AppStatus)
protected void NotifyAppStatusChanged(AppStatus newStatus)
Parameters
newStatus AppStatus
 RunAsync(string, string)
public Task RunAsync(string id, string workingDirectory)
Parameters
id string
workingDirectory string
Returns
Task
 Stop()
public void Stop()
Events
 AppStatusChanged
public event ISEventHandler AppStatusChanged
Event Type
ISEventHandler
 Edit this page